Masmiseim36/nxpSDK/components/power_manager/devices/MIMXRT798S/fsl_pm_device.c
    POWER_ApplyPD();
}

static void PM_DEV_EnterLowPowerMode(uint8_t stateIndex, pm_resc_mask_t *pSoftRescMask, pm_resc_group_t *pSysRescGroup)
{
    uint32_t enabledResources[7] = {0U, 0U, 0U, 0U, 0U, 0U, 0U};

    assert(pSoftRescMask != NULL);
    assert(pSysRescGroup != NULL);

    switch (stateIndex)
    {
        case PM_LP_STATE_SLEEP:
            /*
             * Change PDRUNCFG depending on constraints, POWER_EnablePD then POWER_ApplyPD
             */
            PM_DEV_DisablePeripheralsSleep(pSoftRescMask, pSysRescGroup);
            break;
        case PM_LP_STATE_DEEP_SLEEP:
        case PM_LP_STATE_DSR:
            /*
             * Change PDSLEEPCFG depending on constraints
             */
            PM_DEV_EnablePeripheralsDeepSleep(pSoftRescMask, pSysRescGroup, enabledResources);
            break;
        case PM_LP_STATE_DEEP_POWER_DOWN:
            /*
             * Do nothing
             */
            break;
        case PM_LP_STATE_FULL_DEEP_POWER_DOWN:
            /*
             * Do nothing
             */
            break;
        default:
            /* Should not goes here. */
            break;
    }
    POWER_EnterPowerMode((power_mode_cfg_t)stateIndex, enabledResources);
}

static void PM_DEV_CleanExitLowPowerMode(void)
{
    /* Do nothing. */
}

static status_t PM_DEV_ManageWakeupSource(pm_wakeup_source_t *ws, bool enable)
{
    uint32_t irqn;
    uint32_t misc;

    (void)(misc);

    assert(ws != NULL);
    PM_DECODE_WAKEUP_SOURCE_ID(ws->wsId);

    if (enable)
    {
        EnableDeepSleepIRQ((IRQn_Type)irqn);
    }
    else
    {
        DisableDeepSleepIRQ((IRQn_Type)irqn);
    }
    return kStatus_Success;
}
